УТ_11_4.Umico/src/Catalogs/UMC_ПараметрыПодключенияКUmico/UMC_ПараметрыПодключенияКUmico.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UMC_ПараметрыПодключенияКUmico</name>
  <attributes>
    <name>APIKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POSID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользования</name>
    <type>
      <types>EnumRef.UMC_ВариантыИспользованияПодключенияКUmico</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_11_4.Umico/src/Enums/UMC_ВариантыИспользованияПодключенияКUmico/UMC_ВариантыИспользованияПодключенияКUmico.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>UMC_ВариантыИспользованияПодключенияКUmico</name>
  <enumValues>
    <name>ДляРозничныхПродаж</name>
  </enumValues>
  <enumValues>
    <name>ДляОптовыхПродаж</name>
  </enumValues>
</mdclass:Enum>

УТ_11_4.Umico/src/Catalogs/UMC_ПараметрыПодключенияКUmico/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработка проверки заполнения.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  ПроверяемыеРеквизиты - Массив из Строка - Проверяемые реквизиты
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантИспользования = Перечисления.UMC_ВариантыИспользованияПодключенияКUmico.ДляРозничныхПродаж Тогда
		ПроверяемыеРеквизиты.Добавить("КассаККМ");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Пользователь");
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантИспользования = Перечисления.UMC_ВариантыИспользованияПодключенияКUmico.ДляРозничныхПродаж Тогда
		Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		КассаККМ = Справочники.КассыККМ.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
